import os
import time

os.system("clear")
time.sleep(1)
print("\033[1;32m Loading Your Request....")
print("\033[1;33m[====]                               007%")
time.sleep(0.40)
print("\033[1;31m[=====]                              010%")
time.sleep(0.45)
print("\033[1;33m[=======]                            015%")
time.sleep(0.35)
print("\033[1;31m[=========]                          027%")
time.sleep(0.30)
print("\033[1;33m[===========]                        033%")
time.sleep(0.40)
print("\033[1;31m[=============]                      048%")
time.sleep(0.32)
print("\033[1;33m[================]                   055%")
time.sleep(0.38)
print("\033[1;31m[==================]                 069%")
time.sleep(0.20)
print("\033[1;33m[=====================]              074%")
time.sleep(0.28)
print("\033[1;31m[=========================]          082%")
time.sleep(0.45)
print("\033[1;33m[=============================]      094%")
time.sleep(0.23)
print("\033[1;31m[================================]   100%")
print("")
print("\033[1;36m Loading Success...")

os.system("clear")
time.sleep(2)

# tool banner
print("  ")
print('''  __  __       _______ _    _  _____
|  \/  |   /\|__   __| |  | |/ ____|
| \  / |  /  \  | |  | |__| | (___ 
| |\/| | / /\ \ | |  |  __  |\___ \
| |  | |/ ____ \| |  | |  | |____) |
|_|  |_/_/    \_\_|  |_|  |_|_____/
                               v.2.0
                           Author>>Avishka Ravindu''')
print(' ')

a = int(input("🔰 \033[1;32mමුළු වටිනාකම>>"))
time.sleep(0.3)
print(" ")
b = int(input("🔰 \033[1;33mමුලින් ගෙවන මුදල>>"))
time.sleep(0.3)
print(" ")
c = int(input("🔰 \033[1;32mමුළු වාරික ගණන>>"))
time.sleep(0.3)
print(" ")
d = int(input("🔰 \033[1;33mවාර්ෂික පොලී අනුපාතය>>"))

time.sleep(1)
print("\033[1;32m Loading Your Request....")
print("\033[1;33m[====]                               007%")
time.sleep(0.40)
print("\033[1;31m[=====]                              010%")
time.sleep(0.45)
print("\033[1;33m[=======]                            015%")
time.sleep(0.35)
print("\033[1;31m[=========]                          027%")
time.sleep(0.30)
print("\033[1;33m[===========]                        033%")
time.sleep(0.40)
print("\033[1;31m[=============]                      048%")
time.sleep(0.32)
print("\033[1;33m[================]                   055%")
time.sleep(0.38)
print("\033[1;31m[==================]                 069%")
time.sleep(0.20)
print("\033[1;33m[=====================]              074%")
time.sleep(0.28)
print("\033[1;31m[=========================]          082%")
time.sleep(0.45)
print("\033[1;33m[=============================]      094%")
time.sleep(0.23)
print("\033[1;31m[================================]   100%")
print("")
print("\033[1;36m Loading Success...")
time.sleep(0.45)
os.system("clear")
print(" ")
# tool banner
print("  ")
print('''  __  __       _______ _    _  _____
|  \/  |   /\|__   __| |  | |/ ____|
| \  / |  /  \  | |  | |__| | (___ 
| |\/| | / /\ \ | |  |  __  |\___ \
| |  | |/ ____ \| |  | |  | |____) |
|_|  |_/_/    \_\_|  |_|  |_|_____/
                               v.2.0
                           Author>>Avishka Ravindu''')

time.sleep(0.45)

# මුළු ණය මුදල
e = (a - b)
print("  \033[1;33m📛ණය මුදල=", e)
print(" ")
time.sleep(0.45)
# මසක ණය මුදලේ කොටස
f = (e / c)
print("   \033[1;35m📛මසක ණය මුදලේ කොටස=", f)
print(" ")
time.sleep(0.45)
# මසක පොලිය
g = f * d / 100 * 1 / 12
print("   \033[1;33m📛මසක පොලිය=", g)
print(" ")
time.sleep(0.45)
# මාස ඒකක ගණන
h = (c / 2)
i = (c + 1)
j = (h * i)
print("   \033[1;35m📛මාස ඒකක ගණන=", j)
print(" ")
time.sleep(0.45)
# මුළු පොලිය
k = (g * j)
print("   \033[1;33m📛මුළු පොලිය=", k)
print(" ")
time.sleep(0.45)
# මාස වාරිකයක මුදල
l = (f + k / c)
time.sleep(0.45)
print("   \033[1;35m📛මාස වාරිකයක අගය=", l)
print(" ")
print(" ")

print(" ")

time.sleep(0.45)
print("         \033[1;36m       🙂❤️Thank you for Use My Tool🙂❤️")